#ifndef OBJ
#define OBJ

/*		Список объектов, описание и их связи:
*	- Application - в нём будет начальные конфигурации, крутится: меню, пауза, следилка за тем кто выиграл.
*	- Map - будет хранить карту, загружать её, менять, возвращать то, что на ходится по определённым координатам
*	- Block - "кирпичик" для стены
*	- Vehicle - любая техника
*	- Bullet - то, чем стреляет танк
*	- Tank (наследует Vehicle) - сам танк
*
*		Характеристики игры:
*	- В игре есть баталия техники против техники (танки вертолеты и проч.)
*/

#endif